#include <stdio.h>
#include <math.h>

void drawRomb(const int a);

int main(void){
    const int a = 5;
    drawRomb(a);
    return 0;
}

// функция по рисованию ромба
void drawRomb(const int a){
    // переменная будет использоваться для выяснения количества *
    const int aplus1=a+1; 
    
    //будет использоваться в циклах для печатания пробелов и * соответственно
    int k, j; 

    /*Узнаём сколько пробелов нужно напечатать на первой строке ((a-1)/2) перед первой *
      и добовляем знак минус *(-1) */
    int signed_numSpace=((a-1)/2)*(-1);

    int numSpace; //будет тоже использоваться для количества печатаемых пробелов, но уже без знака минус

    // Начинаем внешний цикл. Если a==5, то цикл начнёися с i=-5, 
    // и с каждой следующей итерацией i будет увеличиваться на 2, пока не достигнет 5-ти
    for(int i=a*(-1); i<=a; i=i+2){
        
        /*Один раз нужно будет пропустить одну итерацию, чтобы два раза не напечатать
          одну и туже строку при i==-1 и при i==1, т.к. по 
          модулю это одно и тоже число равное 1*/ 
        if(i==1) continue; 
        //------------------------------------------------

        //Получаем число пробелов без знака минус
        numSpace = abs(signed_numSpace);

        //Пичатаем пробелы
        for(k=1; k<=numSpace; k++){
            putchar(' ');
        }

        // Узнаем количество пробелов для следущё строки. Получается если значение было -5, то станет -3
        // а потом знак уберётся через функцию abs() как было показано выше на 37 строке
        signed_numSpace++;

        //Узнаём сколько звёздочек напечатать
        //Если a==5, то aplus1==6, и если это вторая строка
        //то i==-3, следовательно 6-abs(-3) = 3 звёздочки
        int number_of_stars = aplus1-abs(i);
        
        //Внутренний цикл для печатания звёздочек
        for(j=1; j<=number_of_stars; j++){
            putchar('*');
        }
        
        //делаем перенос на следующую строку
        putchar('\n');
    }    
}